Revit 2027 API
Rebar.IncludeLastBar Property
 Identifies if the last bar in rebar set is shown.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeLastBar { get; set; }
Public Property IncludeLastBar As Boolean
	Get
	Set
public:
property bool IncludeLastBar {
	bool get ();
	void set (bool value);
}
member IncludeLastBar : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace